data1 = [
    {
        value : 400,
        a: '0001',  //自定义标签样式，仅对该数据项有效
        b: '0002',
        c: '0003'
    },
    {
        value : 333,
        a: '1001',  //自定义标签样式，仅对该数据项有效
        b: '1002',
        c: '1003'
    },
    {
        value : 542,
        a: '2001',  //自定义标签样式，仅对该数据项有效
        b: '2002',
        c: '2003'
    },
    {
        value : 274,
        a: '3001',  //自定义标签样式，仅对该数据项有效
        b: '3002',
        c: '3003'
    },
    {
        value : 442,
        a: '4001',  //自定义标签样式，仅对该数据项有效
        b: '4002',
        c: '4003'
    },
    {
        value : 532,
        a: '5001',  //自定义标签样式，仅对该数据项有效
        b: '5002',
        c: '5003'
    }
];
data2 = [
    {
        value : 340,
        a: 'a221',  //自定义标签样式，仅对该数据项有效
        b: 'a222',
        c: 'a223'
    },
    {
        value : 543,
        a: 'a221',  //自定义标签样式，仅对该数据项有效
        b: 'a222',
        c: 'a223'
    },
    {
        value : 765,
        a: 'a221',  //自定义标签样式，仅对该数据项有效
        b: 'a222',
        c: 'a223'
    },
    {
        value : 246,
        a: 'a221',  //自定义标签样式，仅对该数据项有效
        b: 'a222',
        c: 'a223'
    },
    {
        value : 754,
        a: 'a221',  //自定义标签样式，仅对该数据项有效
        b: 'a222',
        c: 'a223'
    },
    {
        value : 243,
        a: 'a221',  //自定义标签样式，仅对该数据项有效
        b: 'a222',
        c: 'a223'
    }
];
data3 = [
    {
        value : 543,
        a: 'a221',  //自定义标签样式，仅对该数据项有效
        b: 'a332',
        c: 'a223'
    },
    {
        value : 879,
        a: '1221',  //自定义标签样式，仅对该数据项有效
        b: '1332',
        c: '1223'
    },
    {
        value : 146,
        a: '2331',  //自定义标签样式，仅对该数据项有效
        b: '2332',
        c: '2333'
    },
    {
        value : 914,
        a: '3221',  //自定义标签样式，仅对该数据项有效
        b: '3332',
        c: '3223'
    },
    {
        value : 264,
        a: '4221',  //自定义标签样式，仅对该数据项有效
        b: '4332',
        c: '4223'
    },
    {
        value : 378,
        a: '5221',  //自定义标签样式，仅对该数据项有效
        b: '5332',
        c: '5223'
    }
];
data4 = [
    {
        value : 732,
        a: 'tbmm',  //自定义标签样式，仅对该数据项有效
        b: 'dfhj',
        c: 'a223'
    },
    {
        value : 902,
        a: '1221',  //自定义标签样式，仅对该数据项有效
        b: '1d32',
        c: 'dss'
    },
    {
        value : 413,
        a: 'sdad',  //自定义标签样式，仅对该数据项有效
        b: 'cvggg',
        c: 'bnjj'
    },
    {
        value : 615,
        a: 'mkug',  //自定义标签样式，仅对该数据项有效
        b: 'vbmh',
        c: 'teew'
    },
    {
        value : 326,
        a: 'dfff',  //自定义标签样式，仅对该数据项有效
        b: 'fff',
        c: 'wsss'
    },
    {
        value : 653,
        a: 'ssss',  //自定义标签样式，仅对该数据项有效
        b: 'ddd',
        c: 'dddd'
    }
];
data5 = [
    {
        value : 432,
        a: 'mmm',  //自定义标签样式，仅对该数据项有效
        b: 'fff',
        c: 'nnn'
    },
    {
        value : 534,
        a: 'bbb',  //自定义标签样式，仅对该数据项有效
        b: 'bbbb',
        c: 'nnnn'
    },
    {
        value : 645,
        a: 'fff',  //自定义标签样式，仅对该数据项有效
        b: 'fff',
        c: 'bbb'
    },
    {
        value : 876,
        a: 'fff',  //自定义标签样式，仅对该数据项有效
        b: 'ef',
        c: 'eee'
    },
    {
        value : 298,
        a: 'eeee',  //自定义标签样式，仅对该数据项有效
        b: 'wwww',
        c: 'sssw'
    },
    {
        value : 378,
        a: 'dds',  //自定义标签样式，仅对该数据项有效
        b: 'ss',
        c: 'ssss'
    }
];
data6 = [
    {
        value : 672,
        a: 'rff',  //自定义标签样式，仅对该数据项有效
        b: 'fff',
        c: 'bbb'
    },
    {
        value : 368,
        a: 'hhh',  //自定义标签样式，仅对该数据项有效
        b: 'hh',
        c: 'hhh'
    },
    {
        value : 721,
        a: '2331',  //自定义标签样式，仅对该数据项有效
        b: 'hhhh',
        c: 'hhhh'
    },
    {
        value : 546,
        a: 'ooo',  //自定义标签样式，仅对该数据项有效
        b: 'ooo',
        c: 'pppp'
    },
    {
        value : 264,
        a: 'ww',  //自定义标签样式，仅对该数据项有效
        b: 'pp',
        c: 'lll'
    },
    {
        value : 434,
        a: 'qwq',  //自定义标签样式，仅对该数据项有效
        b: 'sss',
        c: 'ccc'
    }
];
s_data = [data1,data2,data3,data4,data5,data6];
m_data = [data4,data5,data6,data3,data2,data1];
l_data = [data5,data1,data6,data2,data4,data3];